---
type: TypeBinding
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# TypeBinding

`Autodesk.Revit.DB.TypeBinding` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TypeBinding | — | `` |
| Constructor | TypeBinding | — | `public TypeBinding ()` |